# Họ tên: Nguyễn Vũ Hải
# Lớp: CNTT K18 CLC
# Mã SV: DTC195480201CLC0006

In [3]:
import pandas as pd
import numpy as np

# Bài 1. Tạo 1 DataFrame tên 'df' từ mảng numpy array kích thước 20x5 các số nguyên có giá trị ngẫu nhiên từ 0 đến 20, với tên cột là ['c0','c1', 'c2'. 'c3', 'c4']. Hãy mô tả các thông số thống kê của 'df'.

In [61]:
arr = np.random.randint(0,20,(20,5))
#print(arr)
df = pd.DataFrame(arr,columns = ['c0','c1', 'c2', 'c3', 'c4'])
display(df.head(5))

   c0  c1  c2  c3  c4
0   7   1   7  14   7
1  10   2   8  13   2
2   9  19   9   7   8
3   4   9   0   0   8
4   1   9  10   1   2

# Bài 2. Thực hiện các thao tác sau với df:
    a. Hiển thị 4 entries đầu tiên và 2 entries cuối cùng của df
    b. Hiển thị 10 phần tử đầu tiên của cột "c1"
    c. Hiển thị 3 phần tử cuối cùng của cột "c1"
    d. Bổ sung 1 cột "c5" gồm dãy các số 10.
    e. Tìm phần tử có giá trị lớn nhất trong df.
    f. Xóa hàng thứ 5 và cột 'c1' của df.

In [62]:
print("Hiển thị 4 entries đầu tiên")
display(df.head(4))
print("Hiển thị 2 entries cuối cùng")
display(df.tail(2))

Hiển thị 4 entries đầu tiên

   c0  c1  c2  c3  c4
0   7   1   7  14   7
1  10   2   8  13   2
2   9  19   9   7   8
3   4   9   0   0   8

Hiển thị 2 entries cuối cùng

    c0  c1  c2  c3  c4
18  16  10  12   9   1
19   0  19  15   2  13

In [63]:
print("Hiển thị 10 phần tử đầu tiên của cột c1")
display(df["c1"].head(10))

Hiển thị 10 phần tử đầu tiên của cột c1

0     1
1     2
2    19
3     9
4     9
5    18
6     8
7     7
8     7
9     9
Name: c1, dtype: int32

In [64]:
print("Hiển thị 3 phần tử cuối cùng của cột c1")
display(df["c1"].tail(3))

Hiển thị 3 phần tử cuối cùng của cột c1

17     5
18    10
19    19
Name: c1, dtype: int32

In [65]:
print("Bổ sung 1 cột c5 gồm dãy các số 10.")
df["c5"] = np.ones(20,dtype=int) * 10
display(df.head())

Bổ sung 1 cột c5 gồm dãy các số 10.

   c0  c1  c2  c3  c4  c5
0   7   1   7  14   7  10
1  10   2   8  13   2  10
2   9  19   9   7   8  10
3   4   9   0   0   8  10
4   1   9  10   1   2  10

In [66]:
print("Tìm phần tử có giá trị lớn nhất trong df.")
MaxValueOfEachCol = df.max()
print(f"Giá trị lớn nhất của từng cột {MaxValueOfEachCol}")
print(f"Giá trị lớn nhát toàn bộ df: {np.max(MaxValueOfEachCol)}")

Tìm phần tử có giá trị lớn nhất trong df.
Giá trị lớn nhất của từng cột c0    19
c1    19
c2    18
c3    19
c4    16
c5    10
dtype: int32
Giá trị lớn nhát toàn bộ df: 19

In [67]:
print(" Xóa hàng thứ 5 và cột 'c1' của df.")
print(df.columns)
df = df.drop(df.tail(1).index)
df = df.drop(columns=["c1"])
print(df)

 Xóa hàng thứ 5 và cột 'c1' của df.
Index(['c0', 'c1', 'c2', 'c3', 'c4', 'c5'], dtype='object')
    c0  c2  c3  c4  c5
0    7   7  14   7  10
1   10   8  13   2  10
2    9   9   7   8  10
3    4   0   0   8  10
4    1  10   1   2  10
5    2  18   6   7  10
6   12  15   9   5  10
7    1   3  15   9  10
8   10  15   9  12  10
9   15   4  17  16  10
10   6  18   0  16  10
11  10   6   1   5  10
12  17   3   5   6  10
13  15   3  19  14  10
14   3  12  10   0  10
15  19  12  14  10  10
16   1  14   6   8  10
17  13  12   8   2  10
18  16  12   9   1  10

# Bài 3. Đọc file Salaries.csv vào dataframe tên df_salary và thực hiện các thao tác sau:

    a. Xem kích thước của df_salary
    b. Xem thông tin của df_salary
    c. Mô tả thống kê các thông tin của df_salary
    d. Xác định giá trị trung bình của trường thông tin lương cơ bản "BasePay"
    e. Tính tổng số tiền trả ngoài giờ "OvertimePay"
    f. Tìm tên của nhân viên có số tiền trả ngoài giờ "OvertimePay" cao nhất
    g. Tìm tên của nhân viên được trả lương "TotalPay" cao nhất
    h. Tìm nghề có mức lương cơ sở cao nhất.
    i. Có bao nhiêu nghề nghiệp trong bảng?
    j. Hãy thay thế các giá trị trống và thay thế bằng số 0.

In [70]:
df_salary = pd.read_csv("Salaries.csv")
df_salary.head()

C:\Users\mamto\AppData\Local\Temp\ipykernel_4008\15317537.py:1: DtypeWarning: Columns (3,4,5,6,12) have mixed types. Specify dtype option on import or set low_memory=False.
  df_salary = pd.read_csv("Salaries.csv")

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.6,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.0,56120.71,198306.9,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.6,9737.0,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN

In [71]:
print("a. Xem kích thước của df_salary")
print(f"Kích thước df_salary là: {df_salary.shape}")

a. Xem kích thước của df_salary
Kích thước df_salary là: (148654, 13)

In [72]:
print("b. Xem thông tin của df_salary")
print(f"Xem thông tin df_salary: {df_salary.info()}")

b. Xem thông tin của df_salary
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148654 non-null  object
 2   JobTitle          148654 non-null  object
 3   BasePay           148049 non-null  object
 4   OvertimePay       148654 non-null  object
 5   OtherPay          148654 non-null  object
 6   Benefits          112495 non-null  object
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
 10  Notes             0 non-null       float64
 11  Agency            148654 non-null  object
 12  Status            38119 non-null   object
dtypes: float64(3), int64(2), object(8)
memory usage: 14.7+ MB
Xem thông tin df_salary: None

In [73]:
print("c. Mô tả thống kê các thông tin của df_salary")
print(df_salary.describe())

c. Mô tả thống kê các thông tin của df_salary
                  Id       TotalPay  TotalPayBenefits           Year  Notes
count  148654.000000  148654.000000     148654.000000  148654.000000    0.0
mean    74327.500000   74768.321972      93692.554811    2012.522643    NaN
std     42912.857795   50517.005274      62793.533483       1.117538    NaN
min         1.000000    -618.130000       -618.130000    2011.000000    NaN
25%     37164.250000   36168.995000      44065.650000    2012.000000    NaN
50%     74327.500000   71426.610000      92404.090000    2013.000000    NaN
75%    111490.750000  105839.135000     132876.450000    2014.000000    NaN
max    148654.000000  567595.430000     567595.430000    2014.000000    NaN

In [90]:
print("d. Xác định giá trị trung bình của trường thông tin lương cơ bản BasePay")
df_salary.BasePay = pd.to_numeric(df_salary.BasePay, errors='coerce')
print(f"Giá trị trung bình của BasePay: {df_salary.BasePay.mean(skipna = True)}")

d. Xác định giá trị trung bình của trường thông tin lương cơ bản BasePay
Giá trị trung bình của BasePay: 66325.4488404877

In [120]:
print("e. Tính tổng số tiền trả ngoài giờ OvertimePay")
df_salary.OvertimePay = pd.to_numeric(df_salary.OvertimePay, errors='coerce')
print(f"Giá trị tổng của OverTimePay: {df_salary.OvertimePay.sum(skipna = True)}")

e. Tính tổng số tiền trả ngoài giờ OvertimePay
Giá trị tổng của OverTimePay: 753069802.1199998

In [108]:
print("f. Tìm tên của nhân viên có số tiền trả ngoài giờ OvertimePay cao nhất")
TheHighestEmployeeOverTimePay = df_salary[df_salary.OvertimePay == df_salary.OvertimePay.max()]
FinalName = TheHighestEmployeeOverTimePay["EmployeeName"].values
print(f"Nhân viên có số tiền trả ngoài giờ cao nhất tên là: {FinalName[0]}")

f. Tìm tên của nhân viên có số tiền trả ngoài giờ OvertimePay cao nhất
Nhân viên có số tiền trả ngoài giờ cao nhất tên là: GARY JIMENEZ

In [109]:
print("g. Tìm tên của nhân viên được trả lương TotalPay cao nhất")
TheHighestEmployeeTotalPay = df_salary[df_salary.TotalPay == df_salary.TotalPay.max()]
FinalName = TheHighestEmployeeTotalPay["EmployeeName"].values
print(f"Nhân viên có số tiền trả lương cao nhất tên là: {FinalName[0]}")

g. Tìm tên của nhân viên được trả lương TotalPay cao nhất
Nhân viên có số tiền trả lương cao nhất tên là: NATHANIEL FORD

In [111]:
print("h. Tìm nghề có mức lương cơ sở cao nhất.")
TheHighestJobBasePay = df_salary[df_salary.BasePay == df_salary.BasePay.max()]
JobName = TheHighestEmployeeTotalPay["JobTitle"].values
print(f"Nhân viên có số tiền trả lương cao nhất tên là: {JobName[0]}")

h. Tìm nghề có mức lương cơ sở cao nhất.
Nhân viên có số tiền trả lương cao nhất tên là: GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY

In [112]:
print("i. Có bao nhiêu nghề nghiệp trong bảng?")
print(f"Số nghề nghiệp trong bảng: {len(df_salary.JobTitle.unique())}")

i. Có bao nhiêu nghề nghiệp trong bảng?
Số nghề nghiệp trong bảng: 2159

In [119]:
print("j. Hãy thay thế các giá trị trống và thay thế bằng số 0.")
ReplaceNanWith0 = df_salary.replace(np.nan,0)
print(f"Kiểm tra null trong bảng {ReplaceNanWith0.isnull().sum()}")

j. Hãy thay thế các giá trị trống và thay thế bằng số 0.
Kiểm tra null trong bảng Id                  0
EmployeeName        0
JobTitle            0
BasePay             0
OvertimePay         0
OtherPay            0
Benefits            0
TotalPay            0
TotalPayBenefits    0
Year                0
Notes               0
Agency              0
Status              0
dtype: int64